Revit 2026 API

# LinePatternElementGetLinePattern(Document, ElementId) Method

---

Gets the LinePattern associated to an element or from a built-in line pattern.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static LinePattern GetLinePattern(
	Document document,
	ElementId elementId
)
```
```vb
Public Shared Function GetLinePattern (
	document As Document,
	elementId As ElementId
) As LinePattern
```
```cpp
public:
static LinePattern^ GetLinePattern(
	Document^ document,
	ElementId^ elementId
)
```
```fsharp
static member GetLinePattern :
        document : Document *
        elementId : ElementId -> LinePattern
```

#### Parameters

document Document
     The document in which to retrieve the LinePattern.
elementId ElementId
     The ElementId of the LinePatternElement or the built-in line pattern id.

#### Return Value

LinePattern A copy of LinePattern object.  if the ElementId doesn't represent a line pattern element or built-in line pattern.  for Solid.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

LinePatternElement Class

GetLinePattern Overload

Autodesk.Revit.DB Namespace